Improve README presentation
